1s/ERP/Conf/Documents/Лико_УстановкаРазмераОплатыСделкиУпаковщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_УстановкаРазмераОплатыСделкиУпаковщиков</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПлощадкаУдалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПроизводственныеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазмерОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоРоликовВКоробке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_УстановкаРазмераОплатыСделкиУпаковщиков/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	УстановитьПривилегированныйРежим(Истина);
	
	Дата = НачалоДня(Дата);
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = НачалоДня(ТекущаяДата());
	КонецЕсли;

	// Проверим, что на эту дату больше нет документов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_УстановкаРазмераОплатыСделкиУпаковщиков.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лико_УстановкаРазмераОплатыСделкиУпаковщиков КАК Лико_УстановкаРазмераОплатыСделкиУпаковщиков
		|ГДЕ
		|	Лико_УстановкаРазмераОплатыСделкиУпаковщиков.Ссылка <> &Ссылка
		|	И Лико_УстановкаРазмераОплатыСделкиУпаковщиков.Дата = &Дата
		|	И Лико_УстановкаРазмераОплатыСделкиУпаковщиков.Площадка = &Площадка
		|	И Лико_УстановкаРазмераОплатыСделкиУпаковщиков.ПроизводственноеПомещение = &ПроизводственноеПомещение";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("ПроизводственноеПомещение", ПроизводственноеПомещение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		Отказ = Истина;
		Сообщить("На дату " + Дата + " уже есть документ """ + ВыборкаДетальныеЗаписи.Ссылка + """");
	КонецЕсли;

КонецПроцедуры
